# 1. Imports

In [3]:
#Libraries
import pandas as pd
import numpy as np
import os

In [5]:
#Path
path = r'/Users/davidgriesel/Documents/0 - Analytics Projects/Online Grocery Store'

In [6]:
#Dataset
df_merged_dataset = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'merged_dataset.pkl'))

# 2. Checks

In [8]:
#Dimensions
df_merged_dataset.shape

(32403719, 22)

In [9]:
#Preview
df_merged_dataset.head()

,order_id,user_id,user_order_count,order_day_of_week,order_hour_of_day,days_since_last_order,is_first_order,product_id,add_to_cart_order,reordered,...,department_id,prices,gender,state,age,date_joined,number_of_dependants,marital_status,income,department
0,2539329,1,1,2,8,NaN,True,196,1,0,...,7,9.0,Female,Alabama,31,2019-02-17,3,married,40423,beverages
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,16,12.5,Female,Alabama,31,2019-02-17,3,married,40423,dairy eggs
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,19,4.4,Female,Alabama,31,2019-02-17,3,married,40423,snacks
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,19,4.7,Female,Alabama,31,2019-02-17,3,married,40423,snacks
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,17,1.0,Female,Alabama,31,2019-02-17,3,married,40423,household

##### Observations:
- Consistent with integrated dataset

# 3. Derive New Variables

## 3.1. Busiest Days

In [13]:
#Check frequency distribution of variable
df_merged_dataset['order_day_of_week'].value_counts(dropna = False)

order_day_of_week
0    6203898
1    5660040
6    4496316
2    4213690
5    4205651
3    3840418
4    3783706
Name: count, dtype: int64

In [14]:
#Create loop and place results in list
result_1 = []

for value in df_merged_dataset['order_day_of_week']:
    if value == 0 or value == 1:
        result_1.append('Most Busy')
    elif value == 3 or value == 4:
        result_1.append('Moderately Busy')
    else:
        result_1.append('Least Busy')

In [15]:
#Create new variable and set it equal to results of loop
df_merged_dataset['busiest_days'] = result_1

In [16]:
#Dimensions
df_merged_dataset.shape

(32403719, 23)

In [17]:
# Group by label and count occurrences
count = df_merged_dataset['busiest_days'].value_counts(dropna=False).reset_index()
count.columns = ['busiest_days', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'busiest_days': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

      busiest_days     count
0       Least Busy  12915657
1        Most Busy  11863938
2  Moderately Busy   7624124
3            Total  32403719

## 3.2. Busiest Hours

In [19]:
#Check frequency distribution of variable
df_merged_dataset['order_hour_of_day'].value_counts()

order_hour_of_day
10    2761660
11    2736010
14    2689036
15    2662044
13    2660846
12    2618430
16    2535106
9     2454127
17    2087564
8     1718082
18    1636436
19    1258275
20     976134
7      891026
21     795619
22     634207
23     402314
6      290491
0      218763
1      115698
5       87957
2       69373
4       53240
3       51281
Name: count, dtype: int64

In [24]:
#Create loop and place results in list
result_2 = []

for value in df_merged_dataset['order_hour_of_day']:
    if value in [10, 11, 12, 13, 14, 15, 16]: # More than 2m orders
        result_2.append('Most Busy')
    elif value in [0, 1, 2, 3, 4, 5, 6]: #less than 500k orders
        result_2.append('Least Busy')
    else:
        result_2.append('Moderately Busy')

In [25]:
#Create new variable and set it equal to results of loop
df_merged_dataset['busiest_hours'] = result_2

In [26]:
#Dimensions
df_merged_dataset.shape

(32403719, 24)

In [27]:
# Group by label and count occurrences
count = df_merged_dataset['busiest_hours'].value_counts(dropna=False).reset_index()
count.columns = ['busiest_hours', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'busiest_hours': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

     busiest_hours     count
0        Most Busy  18663132
1  Moderately Busy  12853784
2       Least Busy    886803
3            Total  32403719

## 3.3. Price Label

In [29]:
# Set Pandas to display all rows
pd.set_option('display.max_rows', None)

In [30]:
#Check frequency distribution of variable
df_merged_dataset['prices'].value_counts(dropna = False).sort_index()

prices
1.00     115143
1.10     242782
1.20     256258
1.30     425691
1.40     392209
1.50     154527
1.60     299352
1.70     213967
1.80     321184
1.90     156179
2.00     286259
2.10     206004
2.20     160243
2.30     242051
2.40     196042
2.50     246421
2.60     211936
2.70     199785
2.80     153979
2.90     264138
3.00     192650
3.10     249256
3.20     253782
3.30     238041
3.40     223571
3.50     222786
3.60     300127
3.70     222159
3.80     315426
3.90     212805
4.00     447272
4.10     268269
4.20     245755
4.30     162367
4.40     357026
4.50     367223
4.60     144069
4.70     221048
4.80     193853
4.90     318220
5.00     225904
5.10     224797
5.20     251509
5.30     284243
5.40     206769
5.50     250136
5.60     183638
5.70     323997
5.80     241047
5.90     208900
6.00     196985
6.10     244209
6.20     178656
6.30     438467
6.40     206460
6.50     278357
6.60     204936
6.70     379126
6.80     354168
6.90     314196
7.00     282884
7.10     140813
7.20     223120
7.30     411924
7.40     233506
7.50     239261
7.60     113878
7.70     190070
7.80     186923
7.90     342988
8.00     151542
8.10     176805
8.20     404015
8.30     276230
8.40     227493
8.50     139244
8.60     254009
8.70     166742
8.80     318091
8.90     219412
9.00     228576
9.10     320782
9.20     182411
9.30     168917
9.40     197179
9.50     165789
9.60     216626
9.70     120777
9.80     194754
9.90     169251
9.99        698
10.00    127842
10.10    139263
10.20    165789
10.30    510496
10.40    133058
10.50    237657
10.60    204242
10.70    191705
10.80     89927
10.90    165607
11.00    183505
11.10    169709
11.20    212323
11.30    212926
11.40    303015
11.50    225399
11.60    148742
11.70    206199
11.80    284476
11.90    127349
12.00    164717
12.10    181986
12.20    188444
12.30    624261
12.40     97866
12.50    152781
12.60    174427
12.70    124544
12.80    309727
12.90    160860
13.00    114503
13.10    117047
13.20    333183
13.30    173797
13.40    225843
13.50    216276
13.60    172962
13.70    181882
13.80    162616
13.90    145234
14.00    311632
14.10    238211
14.20    119314
14.30    334811
14.40    168272
14.50    129540
14.60    139880
14.70    279291
14.80    188844
14.90    160862
15.00     97261
15.10      2422
15.20       494
15.30      7495
15.40      1175
15.50      2325
15.60       333
15.70      4551
15.80       772
15.90      5078
16.00      1272
16.10      1622
16.20      1823
16.30       287
16.40      3892
16.50      2541
16.60      4212
16.70      3105
16.80      4795
16.90      4971
17.00      3836
17.10      4231
17.20      1001
17.30      4309
17.40      1721
17.50       369
17.60       640
17.70      2073
17.80       981
17.90       137
18.00      1135
18.10      8027
18.20     14923
18.30        11
18.40      1762
18.50      3105
18.60      8451
18.70     10503
18.80      4363
18.90       483
19.00      2823
19.10      2926
19.20       981
19.30      6537
19.40      5457
19.50       453
19.60     28383
19.70      5538
19.80       344
19.90       887
20.00      5775
20.10      3745
20.20       123
20.30       236
20.40      5351
20.50       945
20.60      1167
20.70      6568
20.80       852
20.90      1075
21.00         8
21.10     33805
21.30      7647
21.40       137
21.50        85
21.60     10598
21.70      2553
21.80       546
21.90       689
22.00      1182
22.10      5204
22.20      1178
22.30     19430
22.40      1280
22.50       706
22.60      2275
22.70        99
22.80      1089
22.90      3884
23.00      3265
23.10      9135
23.20     14866
23.30      4803
23.40       368
23.50      1924
23.60      8458
23.70      1346
23.80     12585
23.90      2074
24.00      4327
24.10       978
24.20     15891
24.30      2889
24.40       499
24.50      2148
24.60      1962
24.70      7283
24.80       410
24.90      5781
25.00     13772
Name: count, dtype: int64

In [31]:
# Reset display all rows
pd.reset_option('display.max_rows')

In [32]:
#Define the conditions
conditions = [
    df_merged_dataset['prices'] <= 5,
    (df_merged_dataset['prices'] > 5) & (df_merged_dataset['prices'] <= 10),
    (df_merged_dataset['prices'] > 10) & (df_merged_dataset['prices'] <= 15),
    df_merged_dataset['prices'] > 15
]

#Define corresponding labels
choices = ['Low Price', 'Mid Price', 'High Price', 'Premium Price']

#Create new variable based on the conditions
df_merged_dataset['price_label'] = np.select(conditions, choices, default = 'Unknown')

In [38]:
#Dimensions
df_merged_dataset.shape

(32403719, 25)

In [39]:
# Group by label and count occurrences
count = df_merged_dataset['price_label'].value_counts(dropna=False).reset_index()
count.columns = ['price_label', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'price_label': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

     price_label     count
0      Mid Price  11763148
1      Low Price  10125759
2     High Price  10102261
3  Premium Price    412551
4          Total  32403719

# >>> Export / Import

In [48]:
#Export merged dataset
df_merged_dataset.to_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'final_dataset_1.pkl'))

In [7]:
#Import merged dataset
df_merged_dataset = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'final_dataset_1.pkl'))

## 3.4. Mean Price

In [9]:
#Average spent(price) by user_id per product
df_merged_dataset['avg_price'] = df_merged_dataset.groupby(['user_id'])['prices'].transform('mean')

In [10]:
#Dimensions
df_merged_dataset.shape

(32403719, 26)

## 3.5. Spending Flag

In [12]:
df_merged_dataset['avg_price'].describe()

count    3.240372e+07
mean     7.792048e+00
std      7.348679e-01
min      1.000000e+00
25%      7.379634e+00
50%      7.813158e+00
75%      8.230503e+00
max      2.320000e+01
Name: avg_price, dtype: float64

In [13]:
# Filter the dataset to keep only rows where price_label is "Low Volume, High Price"
df_reg_products = df_merged_dataset[df_merged_dataset['prices'] < 15]

# Apply describe() to the avg_price column of the filtered dataset
df_reg_products['avg_price'].describe()

count    3.189391e+07
mean     7.786021e+00
std      7.328643e-01
min      1.000000e+00
25%      7.375368e+00
50%      7.808442e+00
75%      8.225000e+00
max      2.011429e+01
Name: avg_price, dtype: float64

In [14]:
# Define conditions
conditions = [
    df_merged_dataset['avg_price'] <= 5,
    (df_merged_dataset['avg_price'] > 5) & (df_merged_dataset['avg_price'] <= 10),
    (df_merged_dataset['avg_price'] > 10) & (df_merged_dataset['avg_price'] <= 15),
    df_merged_dataset['avg_price'] > 15
]
# Define corresponding labels
labels = ['Low Spender', 
          'Moderate Spender', 
          'High Spender',
          'Premium Spender']

# Assign loyalty flags using np.select()
df_merged_dataset['spending_flag'] = np.select(conditions, labels, default = 'Unknown')

In [15]:
#Dimensions
df_merged_dataset.shape

(32403719, 27)

In [16]:
# Group by label and count occurrences
count = df_merged_dataset['spending_flag'].value_counts(dropna=False).reset_index()
count.columns = ['spending_flag', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'spending_flag': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

      spending_flag     count
0  Moderate Spender  32196692
1      High Spender    119204
2       Low Spender     87560
3   Premium Spender       263
4             Total  32403719

## 3.6. Max Order

In [18]:
#Group by 'user_id' and return the 'max_order' number in new column
df_merged_dataset['max_order'] = df_merged_dataset.groupby(['user_id'])['user_order_count'].transform('max')

In [19]:
#Dimensions
df_merged_dataset.shape

(32403719, 28)

## 3.7. Activity Flag

In [21]:
df_merged_dataset['max_order'].describe()

count    3.240372e+07
mean     3.305262e+01
std      2.515541e+01
min      1.000000e+00
25%      1.300000e+01
50%      2.600000e+01
75%      4.700000e+01
max      9.900000e+01
Name: max_order, dtype: float64

In [22]:
# Define conditions
conditions = [
    df_merged_dataset['max_order'] <= 13, #bottom 25%
    (df_merged_dataset['max_order'] > 13) & (df_merged_dataset['max_order'] <= 47), #middle 50%
    df_merged_dataset['max_order'] > 47 #top 25%
]

# Define corresponding labels
labels = ['Low Activity', 'Moderate Activity', 'High Activity']

# Assign loyalty flags using np.select()
df_merged_dataset['activity_flag'] = np.select(conditions, labels, default = 'Unknown')

In [23]:
#Dimensions
df_merged_dataset.shape

(32403719, 29)

In [24]:
# Group by label and count occurrences
count = df_merged_dataset['activity_flag'].value_counts(dropna=False).reset_index()
count.columns = ['activity_flag', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'activity_flag': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

       activity_flag     count
0  Moderate Activity  15940760
1       Low Activity   8493912
2      High Activity   7969047
3              Total  32403719

# >>> Export / Import

In [26]:
#Export merged dataset
df_merged_dataset.to_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'final_dataset_2.pkl'))

In [42]:
#Import merged dataset
df_merged_dataset = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'final_dataset_2.pkl'))

## 3.8. Median Days

In [44]:
#Median of days_since_prior_order by user_id
df_merged_dataset['median_days'] = df_merged_dataset.groupby(['user_id'])['days_since_last_order'].transform('median')

In [45]:
#Dimensions
df_merged_dataset.shape

(32403719, 30)

## 3.9. Frequency Flag

In [47]:
df_merged_dataset['median_days'].describe()

count    3.240371e+07
mean     1.039772e+01
std      7.131751e+00
min      0.000000e+00
25%      6.000000e+00
50%      8.000000e+00
75%      1.300000e+01
max      3.000000e+01
Name: median_days, dtype: float64

In [48]:
# Set Pandas to display all rows
pd.set_option('display.max_rows', None)

In [49]:
#Check frequency distribution of new variable
df_merged_dataset['median_days'].value_counts(dropna = False)

median_days
7.0     5682308
6.0     2983630
8.0     2713829
5.0     2485736
4.0     2314265
30.0    1683797
9.0     1635036
3.0     1479979
10.0    1271481
14.0    1213506
13.0    1058462
11.0    1050002
12.0     970609
15.0     744154
2.0      561162
16.0     514532
21.0     421099
17.0     399564
20.0     372017
18.0     356794
19.0     349284
22.0     265986
23.0     201887
28.0     199952
27.0     173507
24.0     169310
26.0     161920
25.0     152637
1.0      152114
29.0     136905
7.5       50130
6.5       45163
8.5       36095
0.0       34240
9.5       33755
10.5      30913
4.5       29496
5.5       28943
12.5      25362
13.5      23823
11.5      19847
14.5      17736
15.5      15069
18.5      14502
17.5      12968
3.5       12468
20.5       9958
16.5       9822
19.5       9416
25.5       7910
22.5       7842
24.5       7408
2.5        7249
21.5       7111
23.5       6656
28.5       6491
26.5       5571
27.5       5292
29.5       5095
1.5        1684
0.5         235
NaN           5
Name: count, dtype: int64

In [50]:
# Reset display all rows
pd.reset_option('display.max_rows')

In [51]:
#Variable includes 5 NaN values where days_since_last-order is Nan - Include under Rare Shopper
df_null_median_days = df_merged_dataset[df_merged_dataset['median_days'].isna()]
df_null_median_days

,order_id,user_id,user_order_count,order_day_of_week,order_hour_of_day,days_since_last_order,is_first_order,product_id,add_to_cart_order,reordered,...,income,department,busiest_days,busiest_hours,price_label,avg_price,spending_flag,max_order,activity_flag,median_days
25156010,895835,159838,1,0,17,NaN,True,22198,1,0,...,140994,household,Most Busy,Moderately Busy,Low Price,7.42,Moderate Spender,1,Low Activity,NaN
25156011,895835,159838,1,0,17,NaN,True,23695,2,0,...,140994,frozen,Most Busy,Moderately Busy,Low Price,7.42,Moderate Spender,1,Low Activity,NaN
25156012,895835,159838,1,0,17,NaN,True,10749,3,0,...,140994,produce,Most Busy,Moderately Busy,Mid Price,7.42,Moderate Spender,1,Low Activity,NaN
25156013,895835,159838,1,0,17,NaN,True,21334,5,0,...,140994,produce,Most Busy,Moderately Busy,High Price,7.42,Moderate Spender,1,Low Activity,NaN
25156014,895835,159838,1,0,17,NaN,True,33401,6,0,...,140994,dairy eggs,Most Busy,Moderately Busy,High Price,7.42,Moderate Spender,1,Low Activity,NaN

In [52]:
# Define conditions
conditions = [
    df_merged_dataset['median_days'] <= 6,
    (df_merged_dataset['median_days'] > 6) & (df_merged_dataset['median_days'] <= 13),
    df_merged_dataset['median_days'] > 13,
    df_merged_dataset['median_days'].isna()
]

# Define corresponding labels
labels = ['Frequent Shopper', 'Occasional Shopper', 'Rare Shopper', 'Rare Shopper']

# Assign loyalty flags using np.select()
df_merged_dataset['frequency_flag'] = np.select(conditions, labels, default = 'Unknown')

In [53]:
#Dimensions
df_merged_dataset.shape

(32403719, 31)

In [54]:
# Group by label and count occurrences
count = df_merged_dataset['frequency_flag'].value_counts(dropna=False).reset_index()
count.columns = ['frequency_flag', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'frequency_flag': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

       frequency_flag     count
0  Occasional Shopper  14622992
1    Frequent Shopper  10091201
2        Rare Shopper   7689526
3               Total  32403719

## 3.10. Loyalty Score

In [56]:
# Define mapping of flags to numerical scores
spending_mapping = {'Low Spender': 1, 'Moderate Spender': 2, 'High Spender': 3, 'Premium Spender': 4}
activity_mapping = {'Low Activity': 1, 'Moderate Activity': 2, 'High Activity': 3}
frequency_mapping = {'Rare Shopper': 1, 'Occasional Shopper': 2, 'Frequent Shopper': 3}

# Map the categorical flags to numerical scores
df_merged_dataset['spending_score'] = df_merged_dataset['spending_flag'].map(spending_mapping)
df_merged_dataset['activity_score'] = df_merged_dataset['activity_flag'].map(activity_mapping)
df_merged_dataset['frequency_score'] = df_merged_dataset['frequency_flag'].map(frequency_mapping)

# Calculate the Total Loyalty Score
df_merged_dataset['total_loyalty_score'] = (
    df_merged_dataset['spending_score'] +
    df_merged_dataset['activity_score'] +
    df_merged_dataset['frequency_score']
)

In [57]:
#Dimensions
df_merged_dataset.shape

(32403719, 35)

In [58]:
# Group by label and count occurrences
count = df_merged_dataset['spending_score'].value_counts(dropna=False).reset_index()
count.columns = ['spending_score', 'count']

# Add a row for the tQotal sum of unique users
total_row = pd.DataFrame({'spending_score': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

  spending_score     count
0              2  32196692
1              3    119204
2              1     87560
3              4       263
4          Total  32403719

In [59]:
# Group by label and count occurrences
count = df_merged_dataset['activity_score'].value_counts(dropna=False).reset_index()
count.columns = ['activity_score', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'activity_score': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

  activity_score     count
0              2  15940760
1              1   8493912
2              3   7969047
3          Total  32403719

In [60]:
# Group by label and count occurrences
count = df_merged_dataset['frequency_score'].value_counts(dropna=False).reset_index()
count.columns = ['frequency_score', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'frequency_score': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

  frequency_score     count
0               2  14622992
1               3  10091201
2               1   7689526
3           Total  32403719

In [61]:
# Group by label and count occurrences
count = df_merged_dataset['total_loyalty_score'].value_counts(dropna=False).reset_index()
count.columns = ['total_loyalty_score', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'total_loyalty_score': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

  total_loyalty_score     count
0                   6  11423219
1                   8   6585629
2                   4   5146185
3                   5   5058067
4                   7   4151600
5                   3     30083
6                   9      8936
7               Total  32403719

## 3.11. Loyalty Flag

In [63]:
df_merged_dataset['total_loyalty_score'].describe()

count    3.240372e+07
mean     6.058912e+00
std      1.319011e+00
min      3.000000e+00
25%      5.000000e+00
50%      6.000000e+00
75%      7.000000e+00
max      9.000000e+00
Name: total_loyalty_score, dtype: float64

In [64]:
# Define conditions for loyalty categories
conditions = [
    (df_merged_dataset['total_loyalty_score'] <= 4),
    (df_merged_dataset['total_loyalty_score'] > 4) & (df_merged_dataset['total_loyalty_score'] <= 7),
    (df_merged_dataset['total_loyalty_score'] > 7)
]

# Define corresponding loyalty categories
labels = ['Low Loyalty', 'Moderate Loyalty', 'High Loyalty']

# Assign loyalty categories based on conditions
df_merged_dataset['loyalty_flag'] = np.select(conditions, labels, default = 'Unknown')

In [65]:
#Dimensions
df_merged_dataset.shape

(32403719, 36)

In [66]:
# Group by label and count occurrences
count = df_merged_dataset['loyalty_flag'].value_counts(dropna=False).reset_index()
count.columns = ['loyalty_flag', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'loyalty_flag': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

       loyalty_flag     count
0  Moderate Loyalty  20632886
1      High Loyalty   6594565
2       Low Loyalty   5176268
3             Total  32403719

# >>> Export / Import

In [68]:
#Export merged dataset
df_merged_dataset.to_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'final_dataset_3.pkl'))

In [10]:
#Import merged dataset
df_merged_dataset = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'final_dataset_3.pkl'))

## 3.12. Region

In [107]:
#View values in state variable
df_merged_dataset['state'].value_counts(dropna = False).sort_index()

state
Alabama                 637971
Alaska                  648487
Arizona                 653930
Arkansas                636136
California              659765
Colorado                639260
Connecticut             622998
Delaware                637000
District of Columbia    613685
Florida                 629023
Georgia                 656373
Hawaii                  632887
Idaho                   607091
Illinois                632998
Indiana                 627258
Iowa                    625475
Kansas                  637516
Kentucky                632484
Louisiana               637466
Maine                   638559
Maryland                626555
Massachusetts           646352
Michigan                630918
Minnesota               647791
Mississippi             632637
Missouri                640706
Montana                 635241
Nebraska                625771
Nevada                  636117
New Hampshire           615366
New Jersey              627644
New Mexico              654478
New York                635965
North Carolina          651886
North Dakota            638473
Ohio                    628285
Oklahoma                651701
Oregon                  636403
Pennsylvania            667062
Rhode Island            656891
South Carolina          636708
South Dakota            633754
Tennessee               617835
Texas                   640366
Utah                    611913
Vermont                 611713
Virginia                641409
Washington              632826
West Virginia           612278
Wisconsin               628070
Wyoming                 644243
Name: count, dtype: int64

In [110]:
#Count values in state variable
df_merged_dataset['state'].nunique(dropna = False)

51

In [112]:
#Allocate states to regions
result_3 = []
for value in df_merged_dataset['state']:
  if value in ['Maine', 'New Hampshire', 'Vermont', 'Massachusetts', 'Rhode Island', 'Connecticut', 'New York', 'Pennsylvania', 'New Jersey']:
    result_3.append('Northeast')
  elif value in ['Wisconsin', 'Michigan', 'Illinois', 'Indiana', 'Ohio', 'North Dakota', 'South Dakota', 'Nebraska', 'Kansas', 'Minnesota', 'Iowa', 'Missouri']:
    result_3.append('Midwest')
  elif value in ['Delaware', 'Maryland', 'District of Columbia', 'Virginia', 'West Virginia', 'North Carolina', 'South Carolina', 'Georgia', 'Florida', 'Kentucky', 'Tennessee', 'Mississippi', 'Alabama', 'Oklahoma', 'Texas', 'Arkansas', 'Louisiana']:
    result_3.append('South')
  elif value in ['Idaho', 'Montana', 'Wyoming', 'Nevada', 'Utah', 'Colorado', 'Arizona', 'New Mexico', 'Alaska', 'Washington', 'Oregon', 'California', 'Hawaii']:
    result_3.append('West')
  else:
    result_3.append('Unallocated')

In [113]:
#Assign result to a new column
df_merged_dataset['region'] = result_3

In [114]:
#Get dimensions
df_merged_dataset.shape

(32403719, 37)

In [116]:
# Group by label and count occurrences
count = df_merged_dataset['region'].value_counts(dropna=False).reset_index()
count.columns = ['region', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'region': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

      region     count
0      South  10791513
1       West   8292641
2    Midwest   7597015
3  Northeast   5722550
4      Total  32403719

## 3.13. Age

In [118]:
#View values in 'age' column
df_merged_dataset['age'].value_counts(dropna = False).sort_index()

age
18    500446
19    519596
20    502830
21    512511
22    513815
       ...
77    502108
78    495299
79    529724
80    515224
81    509282
Name: count, Length: 64, dtype: int64

In [119]:
df_merged_dataset['age'].describe()

count    3.240372e+07
mean     4.946528e+01
std      1.848556e+01
min      1.800000e+01
25%      3.300000e+01
50%      4.900000e+01
75%      6.500000e+01
max      8.100000e+01
Name: age, dtype: float64

In [120]:
#Allocate age
result_4 = []
for value in df_merged_dataset['age']:
  if value <= 25:
    result_4.append('Young Adult')
  elif value <= 45:
    result_4.append('Adult')
  elif value <= 65:
    result_4.append('Middle Aged')
  else:
    result_4.append('Senior')

In [121]:
#Assign result to a new column
df_merged_dataset['age_profile'] = result_4

In [122]:
#View dimensions
df_merged_dataset.shape

(32403719, 38)

In [123]:
# Group by label and count occurrences
count = df_merged_dataset['age_profile'].value_counts(dropna=False).reset_index()
count.columns = ['age_profile', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'age_profile': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

   age_profile     count
0        Adult  10155790
1  Middle Aged  10115107
2       Senior   8087791
3  Young Adult   4045031
4        Total  32403719

## 3.14. Income

In [125]:
df_merged_dataset['income'].describe()

count    3.240372e+07
mean     9.943758e+04
std      4.305685e+04
min      2.590300e+04
25%      6.700300e+04
50%      9.661700e+04
75%      1.279120e+05
max      5.939010e+05
Name: income, dtype: float64

In [126]:
df_merged_dataset['income'].value_counts(dropna = False).sort_index()

income
25903      20
25911      28
25937      39
25941      31
25955     392
         ...
584097    826
590790     54
591089    176
592409    318
593901    640
Name: count, Length: 108012, dtype: int64

In [127]:
#Allocate income
result_5 = []
for value in df_merged_dataset['income']:
  if value <= 67000:
    result_5.append('Low Income')
  elif value <= 125000:
    result_5.append('Middle Income')
  else:
    result_5.append('High Income')

In [128]:
#Assign result to a new column
df_merged_dataset['income_profile'] = result_5

In [129]:
#View dimensions
df_merged_dataset.shape

(32403719, 39)

In [130]:
# Group by label and count occurrences
count = df_merged_dataset['income_profile'].value_counts(dropna=False).reset_index()
count.columns = ['income_profile', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'income_profile': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

  income_profile     count
0  Middle Income  15672551
1    High Income   8630641
2     Low Income   8100527
3          Total  32403719

# >>> Export / Import

In [132]:
#Export merged dataset
df_merged_dataset.to_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'final_dataset_4.pkl'))

In [5]:
#Import merged dataset
df_merged_dataset = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'final_dataset_4.pkl'))

## 3.15. Parental Status

In [150]:
df_merged_dataset['number_of_dependants'].value_counts(dropna = False).sort_index()

number_of_dependants
0    8097297
1    8080806
2    8090893
3    8134723
Name: count, dtype: int64

In [151]:
#Allocate dependents
result_6 = []
for value in df_merged_dataset['number_of_dependants']:
  if value == 0:
    result_6.append('non-parent')
  elif value > 0:
    result_6.append('parent')
  else:
    result_6.append('unallocated') #Check

In [152]:
#Assign result to a new column
df_merged_dataset['parental_status'] = result_6

In [153]:
#View dimensions
df_merged_dataset.shape

(32403719, 40)

In [154]:
# Group by label and count occurrences
count = df_merged_dataset['parental_status'].value_counts(dropna=False).reset_index()
count.columns = ['parental_status', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'parental_status': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

  parental_status     count
0          parent  24306422
1      non-parent   8097297
2           Total  32403719

## 3.16. Family Status

In [156]:
count = df_merged_dataset['marital_status'].value_counts(dropna=False).reset_index()
count.columns = ['marital_status', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'marital_status': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

                     marital_status     count
0                           married  22755877
1                            single   5325597
2                  divorced/widowed   2771700
3  living with parents and siblings   1550545
4                             Total  32403719

In [157]:
#Cross variables
marital_vs_parental_status = pd.crosstab(df_merged_dataset['marital_status'], df_merged_dataset['parental_status'], dropna = False)
marital_vs_parental_status

parental_status                   non-parent    parent
marital_status
divorced/widowed                     2771700         0
living with parents and siblings           0   1550545
married                                    0  22755877
single                               5325597         0

##### Allocate lables as follows:
- None of the divorced/widowed and single users have children and can be classified as single adults.
- All users that live with their parents or siblings are also parents and can be classified as young parents.
- All married users are parents and can be classified as families.

In [159]:
#Allocate family status
result_7 = []
for value in df_merged_dataset['marital_status']:
  if value == 'divorced/widowed':
    result_7.append('Single Adult')
  elif value == 'living with parents and siblings':
    result_7.append('Young Parent')
  elif value == 'married':
    result_7.append('Family')
  elif value == 'single':
    result_7.append('Single Adult')
  else:
    result_7.append('unallocated')

In [160]:
#Assign result to a new column
df_merged_dataset['family_status'] = result_7

In [161]:
#View dimensions
df_merged_dataset.shape

(32403719, 41)

In [162]:
# Group by label and count occurrences
count = df_merged_dataset['family_status'].value_counts(dropna=False).reset_index()
count.columns = ['family_status', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'family_status': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

  family_status     count
0        Family  22755877
1  Single Adult   8097297
2  Young Parent   1550545
3         Total  32403719

## 3.17. Product Category

In [164]:
#View distribution of values in 'department_id' column
df_merged_dataset[['department_id','department']].value_counts(dropna = False)

department_id  department
4              produce            9479291
16             dairy eggs         5398185
19             snacks             2887550
7              beverages          2688115
1              frozen             2234743
13             pantry             1875369
3              bakery             1172428
15             canned goods       1068058
20             deli               1051249
9              dry goods pasta     866627
17             household           738666
12             meat seafood        708927
14             breakfast           703033
11             personal care       447010
18             babies              423794
6              international       269253
5              alcohol             153696
8              pets                 97716
21             missing              69145
2              other                36291
10             bulk                 34573
Name: count, dtype: int64

##### Categories can be allocated as follows:
- beverages as beverages [7]
- alcoholic as alcoholic beverages [5]
- dairy eggs, deli, meat seafood, produce & bakery as perishables [16,20,12,4,3]
- frozen, bulk, canned goods, dry goods pasta, pantry, snacks & breakfast as non-perishables [1,10,15,9,13,19,14]
- household as household [17]
- personal care as personal care [11]
- pets as pets [8]
- babies as babies [18]
- international, missing & other as miscellaneous [6,21,2]

In [166]:
#Allocate departments
result_8 = []
for value in df_merged_dataset['department_id']:
  if value in [7]:
    result_8.append('beverages')
  elif value in [5]:
    result_8.append('alcoholic beverages')
  elif value in [16,20,12,4,3]:
    result_8.append('perishables')
  elif value in [1,10,15,9,13,19,14]:
    result_8.append('non-perishables')
  elif value in [17]:
    result_8.append('household')
  elif value in [11]:
    result_8.append('personal care')
  elif value in [8]:
    result_8.append('pets')
  elif value in [18]:
    result_8.append('babies')
  elif value in [6,21,2]:
    result_8.append('miscellaneous')
  else:
    result_8.append('unallocated') #Check

In [167]:
#Assign result to a new column
df_merged_dataset['product_category'] = result_8

In [168]:
#View dimensions
df_merged_dataset.shape

(32403719, 42)

In [169]:
# Group by label and count occurrences
count = df_merged_dataset['product_category'].value_counts(dropna=False).reset_index()
count.columns = ['product_category', 'count']

# Add a row for the total sum of unique users
total_row = pd.DataFrame({'product_category': ['Total'], 'count': [count['count'].sum()]})
count = pd.concat([count, total_row], ignore_index=True)

# Display the table
count

      product_category     count
0          perishables  17810080
1      non-perishables   9669953
2            beverages   2688115
3            household    738666
4        personal care    447010
5               babies    423794
6        miscellaneous    374689
7  alcoholic beverages    153696
8                 pets     97716
9                Total  32403719

# 4. Exports

In [171]:
#Confirm dimensions
df_merged_dataset.shape

(32403719, 42)

In [ ]:
#Export merged dataset
df_merged_dataset.to_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'final_dataset_5.pkl'))